socialNetwork/jaeger_traces/limit_socnetapp_post-storage-service/traces_1.0.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 4.982ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.409ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.707ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.724ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.786ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.744ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.070ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.732ms, rate sampling interval: 11ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.63ms  735.50us   6.59ms   74.83%
    Req/Sec    25.48     48.30   200.00     75.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.51ms
 75.000%    5.03ms
 90.000%    5.55ms
 99.000%    6.59ms
 99.900%    9.57ms
 99.990%   15.27ms
 99.999%   15.27ms
100.000%   15.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.309     0.000000            1         1.00
       3.863     0.100000          391         1.11
       4.037     0.200000          781         1.25
       4.203     0.300000         1170         1.43
       4.359     0.400000         1573         1.67
       4.511     0.500000         1960         2.00
       4.603     0.550000         2147         2.22
       4.687     0.600000         2342         2.50
       4.787     0.650000         2536         2.86
       4.907     0.700000         2730         3.33
       5.027     0.750000         2925         4.00
       5.087     0.775000         3021         4.44
       5.151     0.800000         3121         5.00
       5.243     0.825000         3221         5.71
       5.327     0.850000         3313         6.67
       5.415     0.875000         3410         8.00
       5.479     0.887500         3460         8.89
       5.555     0.900000         3509        10.00
       5.623     0.912500         3559        11.43
       5.687     0.925000         3606        13.33
       5.779     0.937500         3656        16.00
       5.835     0.943750         3681        17.78
       5.871     0.950000         3704        20.00
       5.939     0.956250         3728        22.86
       5.999     0.962500         3753        26.67
       6.055     0.968750         3777        32.00
       6.087     0.971875         3788        35.56
       6.143     0.975000         3800        40.00
       6.203     0.978125         3813        45.71
       6.303     0.981250         3825        53.33
       6.367     0.984375         3837        64.00
       6.423     0.985938         3843        71.11
       6.479     0.987500         3849        80.00
       6.563     0.989062         3856        91.43
       6.679     0.990625         3861       106.67
       6.751     0.992188         3867       128.00
       6.807     0.992969         3870       142.22
       6.911     0.993750         3873       160.00
       6.943     0.994531         3876       182.86
       7.127     0.995313         3879       213.33
       7.503     0.996094         3882       256.00
       7.663     0.996484         3884       284.44
       7.711     0.996875         3885       320.00
       7.811     0.997266         3887       365.71
       7.879     0.997656         3888       426.67
       8.863     0.998047         3890       512.00
       8.983     0.998242         3891       568.89
       8.983     0.998437         3891       640.00
       9.295     0.998633         3892       731.43
       9.575     0.998828         3893       853.33
      10.863     0.999023         3894      1024.00
      10.863     0.999121         3894      1137.78
      10.863     0.999219         3894      1280.00
      12.591     0.999316         3895      1462.86
      12.591     0.999414         3895      1706.67
      14.279     0.999512         3896      2048.00
      14.279     0.999561         3896      2275.56
      14.279     0.999609         3896      2560.00
      14.279     0.999658         3896      2925.71
      14.279     0.999707         3896      3413.33
      15.271     0.999756         3897      4096.00
      15.271     1.000000         3897          inf
#[Mean    =        4.634, StdDeviation   =        0.736]
#[Max     =       15.264, Total count    =         3897]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5829 requests in 30.10s, 1.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 9512
Requests/sec:    193.68  
Transfer/sec:     40.66KB